odrxInitStaticModuleMap(STATIC_MODULE_DESC*)
\details
Defines the start of the static module map, which contains entries for all custom ODA Platform modules
that are linked in statically to a client application.
\details
Defines the entry in the static module map, which contains entries for all custom ODA Platform modules
that are linked in statically to a client application.
\param AppName [in]  Registered application name, that can be later passed to
OdRxDynamicLinker::loadModule to load the static application.
\param ModuleClassName [in] Name of the C++ class derived from OdRxModule, that
implements support for this module.
\details
\details
Defines the end of the static module map, which contains entries for all custom ODA Platform modules
that are linked in statically to a client application.
\details
Declare the static module map that will be defined in some other place in binary.